Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ha256                 = "27+amzZcf8nh6vzoVhByU3ZUHTp6QKYPX1lwyF2nvYk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:37:29.252+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "27+amzZcf8nh6vzoVhByU3ZUHTp6QKYPX1lwyF2nvYk=" -> "omOWvah33Bx8BqDe9MA73yQ8Do1mnIfbFCTgzyYZq2Y=" # forces replacement
      ~ source_code_size            = 15160275 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_permission.getresultsurl_invoke_permission will be created
  + resource "aws_lambda_permission" "getresultsurl_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/results"
      + statement_id        = "AllowAPIGetResultsURLInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission will be created
  + resource "aws_lambda_permission" "initflow_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-initFlow"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/submit"
      + statement_id        = "AllowAPIInitFlowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.qcnotes_invoke_permission will be created
  + resource "aws_lambda_permission" "qcnotes_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-qcNotes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:cy0g8gkrzd/*/*/qcnotes"
      + statement_id        = "APIQcnotesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_vthn2gpgm",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
              + "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be created
  + resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-info"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9" -> (known after apply)
      ~ code_sha256                 = "y9QnFxonLiO1uOkR/OMHjzQtSpQgdaGHM0uB2MOkyNQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:48:59.264+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "2NOpTMRdfTDToTDaz8eFkm0tLVGJ1eF+Vtj5W08WcgdMlCqb3guEOkklCP0xNwffJC8ZF8V6D5Q/00aFlbFASw==" -> (known after apply) # forces replacement
      ~ source_code_size            = 18422693 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
        id                                     = "gaspi-metadata-20250619023048449900000002"
        # (4 unchanged attributes hidden)

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal-20250619023046541400000001"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_versioning.metadata-bucket will be created
  + resource "aws_s3_bucket_versioning" "metadata-bucket" {
      + bucket = "gaspi-metadata-20250619023048449900000002"
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sbeacon.null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "6782594921101834532" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "2fd01ae235e903cd1abfd015bc9151fcfd1d6322" -> "fae82dadb80f46eacffb27e35880738cb715d327"
        }
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
        id      = "f208a0c7-1361-4b2f-8f0a-fdc1e09afec8"
        name    = "bui-security-headers-policy"
        # (3 unchanged attributes hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d156ruh5gtjnn7.cloudfront.net/prod/ https://d2r2v4c4a6oako.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';" -> "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d156ruh5gtjnn7.cloudfront.net/prod/ https://d2r2v4c4a6oako.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/ https://r4.ontoserver.csiro.au https://www.ebi.ac.uk; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';"
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v0.13.7-alpha-12-gc87e6e1" -> "v0.17.1-alpha-49-g1390dce+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "2827737728877712705" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "7215843c5f50ba982201b2188a5c37015cc92cd6" -> "9683460cfb0e76978d10138e729784560975d024"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "2874028770018107099" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74" -> "e51dec655609c232d7ff7295fb65c90d4c440ad8"
          ~ "compiled_code_hash" = "7215843c5f50ba982201b2188a5c37015cc92cd6" -> "9683460cfb0e76978d10138e729784560975d024"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "68ca2223-48d8-cb1c-1dc4-8e30dae73cfa" -> (known after apply)
      ~ triggers_replace = [
          ~ "v0.13.7-alpha-12-gc87e6e1" -> "v0.17.1-alpha-49-g1390dce+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6458675772609074842" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485352471200" -> "1753771423229947000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1669034735071621660" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304486186081000" -> "1753771422972606800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip" -> "builds/311beeca1414ad2da203a6a7c55cdf5667fd1192ecc47e242f8435b348f173b0.zip"
        id                             = "cognito-sendClinicJobEmail"
      ~ last_modified                  = "2025-06-19T04:05:12.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendClinicJobEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendClinicJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/311beeca1414ad2da203a6a7c55cdf5667fd1192ecc47e242f8435b348f173b0.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/311beeca1414ad2da203a6a7c55cdf5667fd1192ecc47e242f8435b348f173b0.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6599067919884786288" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip" -> "builds/311beeca1414ad2da203a6a7c55cdf5667fd1192ecc47e242f8435b348f173b0.zip"
          ~ "timestamp" = "1750304486457757000" -> "1753771423268739000"
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6991011315337149563" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304486236843200" -> "1753771423277949000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/error-catcher-notifyOnError"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "error-catcher-notifyOnError"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role_policy.additional_json[0] will be created
  + resource "aws_iam_role_policy" "additional_json" {
      + id          = (known after apply)
      + name        = "error-catcher-notifyOnError"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "error-catcher-notifyOnError"
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "error-catcher-notifyOnError-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "error-catcher-notifyOnError"
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Notifies admin when lambda functions encounter an error."
      + filename                       = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
      + function_name                  = "error-catcher-notifyOnError"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = 1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "error-catcher"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "error-catcher"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.error-catcher.module.lambda-notifyOnError.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "error_catcher/lambda/notifyOnError",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
              + runtime       = "python3.13"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.plan.json"
      + id                   = (known after apply)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
          + "timestamp" = "1753771422475329000"
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "svep-qcfigures-lambda-containers" -> (known after apply)
      ~ registry_id = "438465168484" -> (known after apply)
      ~ repository  = "svep-qcfigures-lambda-containers" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0] must be replaced
+/- resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:ap-southeast-3:438465168484:repository/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ id                   = "svep-qcfigures-lambda-containers" -> (known after apply)
      ~ name                 = "svep-qcfigures-lambda-containers" -> "pgxflow-qcfigures-lambda-containers" # forces replacement
      ~ registry_id          = "438465168484" -> (known after apply)
      ~ repository_url       = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:24ccfd70c14977cc4439904b240b0a5766cb4bb2c3d975686eadd9803b9032c1438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:24ccfd70c14977cc4439904b240b0a5766cb4bb2c3d975686eadd9803b9032c1" -> (known after apply)
      ~ name         = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply) # forces replacement
      ~ repo_digest  = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3bfc4d15e407074215ed092ca031f172927061ac062dedd4987a2d416350cd34" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "556ca3fbdd2802f760b81c448fe363262b1724dd" -> "d8518207c61478629fc263726513d54ebc5b3ca1"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:3bfc4d15e407074215ed092ca031f172927061ac062dedd4987a2d416350cd34" -> (known after apply)
      ~ name                 = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply) # forces replacement
      ~ sha256_digest        = "sha256:3bfc4d15e407074215ed092ca031f172927061ac062dedd4987a2d416350cd34" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "556ca3fbdd2802f760b81c448fe363262b1724dd" -> "d8518207c61478629fc263726513d54ebc5b3ca1"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-getResultsURL"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-getResultsURL"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-getResultsURL-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  + {
                      + Action   = "dynamodb:GetItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-getResultsURL"
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-getResultsURL-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-getResultsURL"
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Returns the presigned results URL for PGxFlow results"
      + filename                       = "builds/cf812fe85d2322e600e7b477fa1bcb262dcded7938ffa304715d282804f9e8b9.zip"
      + function_name                  = "pgxflow-backend-getResultsURL"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DPORTAL_BUCKET"             = "gaspi-dataportal-20250619023046541400000001"
              + "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/getResultsURL",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/cf812fe85d2322e600e7b477fa1bcb262dcded7938ffa304715d282804f9e8b9.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/cf812fe85d2322e600e7b477fa1bcb262dcded7938ffa304715d282804f9e8b9.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/cf812fe85d2322e600e7b477fa1bcb262dcded7938ffa304715d282804f9e8b9.zip"
          + "timestamp" = "1753771439335685000"
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-initFlow"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-initFlow"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-initFlow-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-initFlow"
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-initFlow-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-initFlow"
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Initializes a PGxFlow job"
      + filename                       = "builds/f779a31a1fb2bec630f8d9854fd4977e007c07482ebf5eb43697ec76b730a15d.zip"
      + function_name                  = "pgxflow-backend-initFlow"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/initFlow",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f779a31a1fb2bec630f8d9854fd4977e007c07482ebf5eb43697ec76b730a15d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f779a31a1fb2bec630f8d9854fd4977e007c07482ebf5eb43697ec76b730a15d.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f779a31a1fb2bec630f8d9854fd4977e007c07482ebf5eb43697ec76b730a15d.zip"
          + "timestamp" = "1753771439261084000"
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3bfc4d15e407074215ed092ca031f172927061ac062dedd4987a2d416350cd34" -> (known after apply)
      ~ last_modified                  = "2025-06-19T05:41:55.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-qcNotes"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-qcNotes"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-qcNotes-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/*",
                          + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-qcNotes"
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-qcNotes-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-qcNotes"
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running qcNotes API."
      + filename                       = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
      + function_name                  = "pgxflow-backend-qcNotes"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FILE_LOCATION" = "gaspi-dataportal-20250619023046541400000001"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcNotes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/qcNotes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
          + "timestamp" = "1753771439153523000"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-sendJobEmail"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
        
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.